{
    "title": "Privileges Preferences",
    "description": "JSON for SAP's Privileges Application. https://github.com/SAP/macOS-enterprise-privileges",
    "__preferencedomain": "corp.sap.privileges",
    "properties": {
      "DockToggleTimeout": {
        "title": "Fixed Admin Rights Timeout",
        "description": "Set a fixed timeout, in minutes, for the Dock tile's Toggle Privileges command. After this time, the admin rights are removed and set back to standard user rights. A value of 0 disables the timeout and allows the user to permanently toggle privileges",
        "type": "integer"
      },
      "DockToggleMaxTimeout": {
        "title": "Variable Admin Rights Timeout",
        "description": "Set a limit timeout, in minutes, for the Dock tile's Toggle Privileges command. After this time or the time choosen by the user, the admin rights are removed and set back to standard user rights. A value of 0 disables the timeout and allows the user to permanently toggle privileges",
        "type": "integer"
      },
      "RequireAuthentication": {
        "title": "Requires authentication",
        "type": "boolean"
      },
      "EnforcePrivileges": {
        "title": "Enforce Privilege Set",
        "description": "Enforces certain privileges. Whenever Privileges.app or the PrivilegesCLI command line tool are launched,the corresponding privileges are set. admin, user, or none",
        "options": {
          "inputAttributes": {
            "placeholder": "admin"
          }
        },
        "type": "string"
      },
      "LimitToGroup": {
        "title": "Limit to Group",
        "description": "Limits the usage of Privileges.app to the given user group",
        "options": {
          "inputAttributes": {
            "placeholder": "wheel"
          }
        },
        "type": "string"
      },
      "LimitToUser": {
        "title": "Limit to User",
        "description": "Limits the usage of Privileges.app to the given user account",
        "options": {
          "inputAttributes": {
            "placeholder": "UserName"
          }
        },
        "type": "string"
      },
      "ReasonRequired": {
        "title": "Reason Required",
        "type": "boolean"
      },
      "ReasonMinLength": {
        "title": "Minimum Length for Reason",
        "description": "Specifies the minimum number of characters the user has to enter as the reason for becoming an admin",
        "type": "integer",
        "maximum": 100,
        "minimum": 0
      },
      "ReasonMaxLength": {
        "title": "Maximum Length for Reason",
        "description": "Specifies the maxium number of characters the user has to enter as the reason for becoming an admin. Default is 100",
        "type": "integer",
        "maximum": 100,
        "minimum": 1
      },
      "ReasonPresetList": {
        "title": "Reason Presets",
        "description": "A list of predefined reasons that can be used instead of custom text",
        "type": "array",
        "items": {
          "type": "object",
          "title": "Reason",
          "properties": {
            "default": {
              "title": "Text",
              "type": "string"
            }
          }
        }
      },
      "RemoteLogging": {
        "type": "object",
        "title": "Remote Logging",
        "properties": {
          "ServerType": {
            "title": "Server Type",
            "description": "Server type. syslog is the only supported value",
            "type": "string"
          },
          "ServerAddress": {
            "title": "Server Address",
            "description": "IP or Hostname of the Log ingest server",
            "options": {
              "inputAttributes": {
                "placeholder": "logs.company.com"
              }
            },
            "type": "string"
          },
          "ServerPort": {
            "title": "Server Port",
            "description": "Port Log Ingest Server Listens on",
            "type": "integer"
          },
          "EnableTCP": {
            "title": "Enable TCP",
            "description": "Sets Logs messages to TCP. UDP is the default.",
            "type": "boolean"
          },
          "SyslogOptions": {
            "type": "object",
            "title": "Syslog Options",
            "properties": {
              "LogFacility": {
                "title": "Log Facility",
                "description": "Log Facility",
                "type": "integer"
              },
              "LogSeverity": {
                "title": "Log Severity",
                "type": "integer"
              },
              "MaximumMessageSize": {
                "title": "Maximum Message Size",
                "type": "integer"
              }
            }
          }
        }
      }
    },
    "RequireAuthentication": {
      "title": "Require Authentication",
      "description": "Requires authentication before using Privileges.app. If set to true, the logged-in user is prompted to authenticate via Touch ID or by entering their account password",
      "type": "boolean"
    }
  }